#### 🖌 Terraform Format and Style ->`success`
#### ⚙️ Terraform Initialization ->`success`
#### 📖 Terraform Plan ->`success`

<details><summary>Show Plan</summary>

```terraform
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/8047fd37-2dc6-4082-bd8b-0da0ab1a24f9/resourceGroups/rg-espc-online]
azurerm_application_insights.ai: Refreshing state... [id=/subscriptions/8047fd37-2dc6-4082-bd8b-0da0ab1a24f9/resourceGroups/rg-espc-online/providers/microsoft.insights/components/ai-espc-2021]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_sql_database.db will be created
  + resource "azurerm_sql_database" "db" {
      + collation                        = (known after apply)
      + create_mode                      = "Default"
      + creation_date                    = (known after apply)
      + default_secondary_location       = (known after apply)
      + edition                          = "Standard"
      + elastic_pool_name                = (known after apply)
      + encryption                       = (known after apply)
      + extended_auditing_policy         = (known after apply)
      + id                               = (known after apply)
      + location                         = "germanywestcentral"
      + max_size_bytes                   = (known after apply)
      + max_size_gb                      = (known after apply)
      + name                             = "sql-db-espc"
      + read_scale                       = false
      + requested_service_objective_id   = (known after apply)
      + requested_service_objective_name = "S1"
      + resource_group_name              = "rg-espc-online"
      + restore_point_in_time            = (known after apply)
      + server_name                      = "sql-azure-espc-2021"
      + source_database_deletion_date    = (known after apply)
      + source_database_id               = (known after apply)
      + tags                             = {
          + "com.thorsten-hans.conference" = "ESPC2021"
          + "com.thorsten-hans.retention"  = "1-month"
        }

      + threat_detection_policy {
          + disabled_alerts            = (known after apply)
          + email_account_admins       = (known after apply)
          + email_addresses            = (known after apply)
          + retention_days             = (known after apply)
          + state                      = (known after apply)
          + storage_account_access_key = (sensitive value)
          + storage_endpoint           = (known after apply)
          + use_server_default         = (known after apply)
        }
    }

  # azurerm_sql_firewall_rule.sqlallowazureresources will be created
  + resource "azurerm_sql_firewall_rule" "sqlallowazureresources" {
      + end_ip_address      = "0.0.0.0"
      + id                  = (known after apply)
      + name                = "sqlallowazureresourcesrule"
      + resource_group_name = "rg-espc-online"
      + server_name         = "sql-azure-espc-2021"
      + start_ip_address    = "0.0.0.0"
    }

  # azurerm_sql_firewall_rule.sqlallowtfhost will be created
  + resource "azurerm_sql_firewall_rule" "sqlallowtfhost" {
      + end_ip_address      = "40.112.62.183"
      + id                  = (known after apply)
      + name                = (known after apply)
      + resource_group_name = "rg-espc-online"
      + server_name         = "sql-azure-espc-2021"
      + start_ip_address    = "40.112.62.183"
    }

  # azurerm_sql_server.sqlazure will be created
  + resource "azurerm_sql_server" "sqlazure" {
      + administrator_login          = "espcsqladmin"
      + administrator_login_password = (sensitive value)
      + connection_policy            = "Default"
      + extended_auditing_policy     = (known after apply)
      + fully_qualified_domain_name  = (known after apply)
      + id                           = (known after apply)
      + location                     = "germanywestcentral"
      + name                         = "sql-azure-espc-2021"
      + resource_group_name          = "rg-espc-online"
      + tags                         = {
          + "com.thorsten-hans.conference" = "ESPC2021"
          + "com.thorsten-hans.retention"  = "1-month"
        }
      + version                      = "12.0"
    }

  # random_integer.env will be created
  + resource "random_integer" "env" {
      + id     = (known after apply)
      + max    = 9999
      + min    = 1000
      + result = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Author: @ThorstenHans, Action: `pull_request`*